modm-ext/data.modm.io/docs/svd/header_stm32h723xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FMAC</name>
      <description>Filter and Mathematical ACcelerator</description>
      <groupName>FMAC</groupName>
      <baseAddress>0x48024000</baseAddress>
      <interrupt>
        <name>FMAC</name>
        <description>FMAC global interrupt</description>
        <value>153</value>
      </interrupt>
      <registers>
        <register>
          <name>X1BUFCFG</name>
          <description>FMAC X1 Buffer Configuration register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>X1_BASE</name>
              <description>Base address of X1 buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>X1_BUF_SIZE</name>
              <description>Allocated size of X1 buffer in 16-bit words</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>FULL_WM</name>
              <description>Watermark for buffer full flag</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WM_0_THRESHOLD_1</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WM_1_THRESHOLD_2</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WM_2_THRESHOLD_4</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WM_3_THRESHOLD_8</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>X2BUFCFG</name>
          <description>FMAC X2 Buffer Configuration register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>X2_BASE</name>
              <description>Base address of X2 buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>X2_BUF_SIZE</name>
              <description>Size of X2 buffer in 16-bit words</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>YBUFCFG</name>
          <description>FMAC Y Buffer Configuration register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>Y_BASE</name>
              <description>Base address of Y buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>Y_BUF_SIZE</name>
              <description>Size of Y buffer in 16-bit words</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>EMPTY_WM</name>
              <description>Watermark for buffer empty flag</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WM_0_THRESHOLD_1</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WM_1_THRESHOLD_2</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WM_2_THRESHOLD_4</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WM_3_THRESHOLD_8</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PARAM</name>
          <description>FMAC Parameter register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>P</name>
              <description>Input parameter P</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>Q</name>
              <description>Input parameter Q</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>R</name>
              <description>Input parameter R</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>FUNC</name>
              <description>Function</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOAD_X1</name>
                  <description>Load X1 buffer</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOAD_X2</name>
                  <description>Load X2 buffer</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOAD_Y</name>
                  <description>Load Y buffer</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONVO_FIR</name>
                  <description>Convolution (FIR filter)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IIR_DIRECT_FORM_1</name>
                  <description>IIR filter (direct form 1)</description>
                  <value>9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>START</name>
              <description>Enable execution</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>FMAC Control register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RIEN</name>
              <description>Enable read interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WIEN</name>
              <description>Enable write interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVFLIEN</name>
              <description>Enable overflow error interrupts</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UNFLIEN</name>
              <description>Enable underflow error interrupts</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SATIEN</name>
              <description>Enable saturation error interrupts</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMAREN</name>
              <description>Enable DMA read channel requests</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMAWEN</name>
              <description>Enable DMA write channel requests</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLIPEN</name>
              <description>Enable clipping</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESET</name>
              <description>Reset filter mathematical accelerator unit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>FMAC Status register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>YEMPTY</name>
              <description>Y buffer empty flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>X1FULL</name>
              <description>X1 buffer full flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVFL</name>
              <description>Overflow error flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UNFL</name>
              <description>Underflow error flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SAT</name>
              <description>Saturation error flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WDATA</name>
          <description>FMAC Write Data register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WDATA</name>
              <description>Write data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RDATA</name>
          <description>FMAC Read Data register</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RDATA</name>
              <description>Read data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
